# Human Resources Data Analysis (Python, MySQL, PowerBI)

## Part 1: Data Processing (Python, MySQL)

Pengju Sun

2023-06-30

### Problem Statement

The purpose of this project is to analyze Human Resources dataset with 22,21 entries across 13 columns ('id', 'first_name', 'last_name', 'birthdate', 'gender', 'race', 'department', 'jobtitle', 'location', 'hire_date', 'termdate', 'location_city', 'location_state') and leverage PowerBI to create dynamic, interactive data visualization dashboard that provides insights into employee demographics, location distribution and turnover rate.

### Import CSV files to database

In [1]:
# import libraries
import pandas as pd
import numpy as np
import pymysql

In [2]:
# read the dataset
df = pd.read_csv('Human_Resources.csv')

In [3]:
# check the dataset
df.head()

,id,first_name,last_name,birthdate,gender,race,department,jobtitle,location,hire_date,termdate,location_city,location_state
0,00-0037846,Kimmy,Walczynski,06-04-91,Male,Hispanic or Latino,Engineering,Programmer Analyst I,Headquarters,1/20/2002,NaN,Cleveland,Ohio
1,00-0041533,Ignatius,Springett,6/29/1984,Male,White,Business Development,Business Analyst,Headquarters,04-08-19,NaN,Cleveland,Ohio
2,00-0045747,Corbie,Bittlestone,7/29/1989,Male,Black or African American,Sales,Solutions Engineer Manager,Headquarters,10-12-10,NaN,Cleveland,Ohio
3,00-0055274,Baxy,Matton,9/14/1982,Female,White,Services,Service Tech,Headquarters,04-10-05,NaN,Cleveland,Ohio
4,00-0076100,Terrell,Suff,04-11-94,Female,Two or More Races,Product Management,Business Analyst,Remote,9/29/2010,2029-10-29 06:09:38 UTC,Flint,Michigan

In [4]:
# check each data column datatype
df.dtypes

id                object
first_name        object
last_name         object
birthdate         object
gender            object
race              object
department        object
jobtitle          object
location          object
hire_date         object
termdate          object
location_city     object
location_state    object
dtype: object

In [5]:
# If import this dataset into a MySQL databse, it's necessary to convert the 
#datatypes in the pandas DataFrame to align with the corresponding 
# datatypes in MySQL

# build a dictionary for mapping the replacement
replacements = {
    'object': 'VARCHAR',
    'int64': 'INT',
    'float64': 'FLOAT',
    'datatime64[ns]': "TIMESTAMP",
    'timedelta64[ns]' : 'VARCHAR',
    'bool': 'BOOLEAN'
}

In [6]:
# create a column string representing the converted datatypes for each column in MySQL
col_str = ', '.join("{} {}".format(n,b) for n, b in zip(df.columns, df.dtypes.replace(replacements)))
col_str

'id VARCHAR, first_name VARCHAR, last_name VARCHAR, birthdate VARCHAR, gender VARCHAR, race VARCHAR, department VARCHAR, jobtitle VARCHAR, location VARCHAR, hire_date VARCHAR, termdate VARCHAR, location_city VARCHAR, location_state VARCHAR'

#### Importing CSV to MySQL database

In [7]:
# connect to the local MySQL database
db_name = 'HR_Analysis'
db_host = '127.0.0.1'
db_username = 'root'
#db_password = "Becaus8e"

# make the databse connection
try:
        conn = pymysql.connect(host = db_host,
                                                        port = int(3306),
                                                        user = 'root',
                                                       # passwd = db_password,
                                                        db = db_name)
        print("Connection established successfully")
except Exception as e:
        print(f"An error occurred while connecting to the database: {e}")
        
# finally:
#     # Close the cursor and connection to avoid memory leaks
#     if (connection):
#         cursor.close()
#         conn.close()
#         print("MySQL connection is closed")

Connection established successfully

In [8]:
cursor = conn.cursor()

In [18]:
# drop tables with the same table name
cursor.execute('DROP TABLE IF EXISTS Human_Resources;') 
'''
a return value of 0 typically signifies that the operation was successful but did not result in any changes to the database.

For the DROP TABLE IF EXISTS command specifically, a return value of 0 would mean that the table did not exist, so there was nothing to drop.
'''

'\na return value of 0 typically signifies that the operation was successful but did not result in any changes to the database.\n\nFor the DROP TABLE IF EXISTS command specifically, a return value of 0 would mean that the table did not exist, so there was nothing to drop.\n'

In [19]:
# create table 
cursor.execute("""
    CREATE TABLE Human_Resources (
        id VARCHAR(255), 
        first_name VARCHAR(255), 
        last_name VARCHAR(255), 
        birthdate VARCHAR(255), 
        gender VARCHAR(255), 
        race VARCHAR(255), 
        department VARCHAR(255), 
        jobtitle VARCHAR(255), 
        location VARCHAR(255), 
        hire_date VARCHAR(255), 
        termdate VARCHAR(255), 
        location_city VARCHAR(255), 
        location_state VARCHAR(255)
    )
""")

0

In [20]:
# insert values to table

#1. save df to csv
# This step can be skipped in this case since we didn't do any changes on dataset with pandas
# df.to_csv('Human Resources.csv', header = df.column, index = False, encoding = 'utf-8')
#2. open the csv file, save it as an object, and upload to db

with open('Human_Resources.csv', 'r') as file:
    cursor.execute("""
        LOAD DATA INFILE '/Users/pjsun/Desktop/Project_temp/Human_Resources.csv' #Use an absolute path: Make sure you're providing the absolute path to your file in your code, not a relative path.
        INTO TABLE Human_Resources 
        FIELDS TERMINATED BY ',' 
        LINES TERMINATED BY '\n'
        IGNORE 1 ROWS
    """)
    conn.commit()

In [13]:
# # grant table access to public
# cursor.execute('GRANT ALL ON HR_Analysis.Human_Resources TO public;')

In [39]:
cursor.close()
conn.close()
print('Table Human_Resources imported to db completed.')

Table Human_Resources imported to db completed.

### Data Clearning

In [9]:
# use magic command to check the table
%load_ext sql
%sql mysql+mysqldb://root:@localhost/HR_Analysis
%sql SELECT * FROM Human_Resources LIMIT 25;

 * mysql+mysqldb://root:***@localhost/HR_Analysis
25 rows affected.

[('00-0037846', 'Kimmy', 'Walczynski', datetime.date(1991, 6, 4), 'Male', 'Hispanic or Latino', 'Engineering', 'Programmer Analyst I', 'Headquarters', datetime.date(2002, 1, 20), None, 'Cleveland', 'Ohio\r', 32),
 ('00-0041533', 'Ignatius', 'Springett', datetime.date(1984, 6, 29), 'Male', 'White', 'Business Development', 'Business Analyst', 'Headquarters', datetime.date(2019, 4, 8), None, 'Cleveland', 'Ohio\r', 39),
 ('00-0045747', 'Corbie', 'Bittlestone', datetime.date(1989, 7, 29), 'Male', 'Black or African American', 'Sales', 'Solutions Engineer Manager', 'Headquarters', datetime.date(2010, 10, 12), None, 'Cleveland', 'Ohio\r', 33),
 ('00-0055274', 'Baxy', 'Matton', datetime.date(1982, 9, 14), 'Female', 'White', 'Services', 'Service Tech', 'Headquarters', datetime.date(2005, 4, 10), None, 'Cleveland', 'Ohio\r', 40),
 ('00-0076100', 'Terrell', 'Suff', datetime.date(1994, 4, 11), 'Female', 'Two or More Races', 'Product Management', 'Business Analyst', 'Remote', datetime.date(2010, 9, 29), datetime.date(2029, 10, 29), 'Flint', 'Michigan\r', 29),
 ('00-0116166', 'Kacie', 'Offiler', datetime.date(1971, 1, 18), 'Male', 'Asian', 'Engineering', 'Developer III', 'Headquarters', datetime.date(2018, 9, 1), None, 'Cleveland', 'Ohio\r', 52),
 ('00-0363185', 'Sandro', 'Admans', datetime.date(1979, 11, 19), 'Male', 'Two or More Races', 'Product Management', 'Quality Engineer', 'Headquarters', datetime.date(2012, 11, 8), None, 'Cleveland', 'Ohio\r', 43),
 ('00-0380704', 'Eugene', 'Lehrahan', datetime.date(1988, 10, 14), 'Female', 'Black or African American', 'Engineering', 'Developer I', 'Headquarters', datetime.date(2007, 6, 27), None, 'Cleveland', 'Ohio\r', 34),
 ('00-0381660', 'Wainwright', 'Corfield', datetime.date(1996, 12, 13), 'Male', 'Asian', 'Engineering', 'Business Systems Development Analyst', 'Headquarters', datetime.date(2001, 2, 20), datetime.date(2008, 12, 5), 'Cleveland', 'Ohio\r', 26),
 ('00-0419202', 'Dyann', 'Isoldi', datetime.date(1980, 3, 27), 'Male', 'Two or More Races', 'Engineering', 'Web Developer I', 'Headquarters', datetime.date(2005, 1, 27), None, 'Cleveland', 'Ohio\r', 43),
 ('00-0472287', 'Grantley', 'Oret', datetime.date(1975, 9, 6), 'Male', 'Two or More Races', 'Services', 'Service Tech II', 'Headquarters', datetime.date(2004, 11, 1), None, 'Cleveland', 'Ohio\r', 47),
 ('00-0472832', 'Elmore', 'Worner', datetime.date(1966, 1, 7), 'Female', 'White', 'Engineering', 'Business Systems Development Analyst', 'Headquarters', datetime.date(2000, 12, 5), None, 'Cleveland', 'Ohio\r', 57),
 ('00-0566380', 'Dud', 'Brain', datetime.date(1984, 3, 17), 'Male', 'Two or More Races', 'Business Development', 'Business Analyst', 'Headquarters', datetime.date(2008, 9, 17), None, 'Cleveland', 'Ohio\r', 39),
 ('00-0571075', 'Aguie', 'Conford', datetime.date(1971, 11, 2), 'Male', 'White', 'Business Development', 'Research Assistant II', 'Headquarters', datetime.date(2015, 11, 25), None, 'Cleveland', 'Ohio\r', 51),
 ('00-0624189', 'Katerina', 'Rosborough', datetime.date(1967, 8, 20), 'Male', 'Hispanic or Latino', 'Engineering', 'Analyst Programmer', 'Headquarters', datetime.date(2019, 5, 17), None, 'Cleveland', 'Ohio\r', 55),
 ('00-0715212', 'Alida', 'Longley', datetime.date(1973, 1, 28), 'Female', 'American Indian or Alaska Native', 'Accounting', 'Staff Accountant III', 'Headquarters', datetime.date(2002, 2, 4), None, 'Cleveland', 'Ohio\r', 50),
 ('00-0755645', 'Laraine', 'Petre', datetime.date(1967, 5, 11), 'Male', 'White', 'Engineering', 'Software Engineer I', 'Headquarters', datetime.date(2010, 9, 30), None, 'Cleveland', 'Ohio\r', 56),
 ('00-0778934', 'Gareth', 'MacCook', datetime.date(1987, 2, 21), 'Female', 'Black or African American', 'Legal', 'Senior Attorney', 'Remote', datetime.date(2010, 2, 18), None, 'Flint', 'Michigan\r', 36),
 ('00-0794247', 'Scottie', 'Chestney', datetime.date(1972, 2, 23), 'Female', 'Black or African American', 'Engineering', 'Data Visualization Specialist', 'Headquarters', datetime.date(2002, 7, 3), None, 'Cleveland', 'Ohio\r', 51),
 ('00-0948136', 'Christophorus', 'Boseley', datetime.date(1983, 5, 23), 'Female', 'Two or More Races', 'Marketing', 'Senior Editor', 'Headquarters', datetime.date(2007, 9, 6), None, 'Cleveland', 'Ohio\r', 40),
 ('00-0971612', 'Arleyne', 'Froome', datetime.date(1999, 8, 1), 'Male', 'Two or More Races', 'Engineering', 'Software Consultant', 'Headquarters', datetime.date(2015, 4, 9), None, 'Cleveland', 'Ohio\r', 23),
 ('00-1051096', 'Todd', 'Cashen', datetime.date(1999, 6, 19), 'Female', 'White', 'Accounting', 'Financial Analyst', 'Remote', datetime.date(2014, 6, 20), None, 'Pittsburgh', 'Pennsylvania\r', 24),
 ('00-1052230', 'Elmo', 'McNee', datetime.date(1988, 12, 16), 'Female', 'Black or African American', 'Services', 'Service Manager', 'Headquarters', datetime.date(2002, 7, 18), datetime.date(2006, 5, 22), 'Cleveland', 'Ohio\r', 34),
 ('00-1100714', 'Regen', 'Nafzger', datetime.date(1990, 4, 6), 'Male', 'White', 'Human Resources', 'Senior Recruiter', 'Headquarters', datetime.date(2016, 7, 23), datetime.date(2022, 7, 12), 'Cleveland', 'Ohio\r', 33),
 ('00-1147503', 'Penelope', 'Wenman', datetime.date(1994, 12, 19), 'Male', 'White', 'Business Development', 'Research Assistant II', 'Headquarters', datetime.date(2019, 9, 10), None, 'Cleveland', 'Ohio\r', 28)]

In [22]:
# change the id to employee_id
cursor.execute('ALTER TABLE Human_Resources CHANGE id employee_id VARCHAR(255);')

0

In [10]:
%sql SELECT * FROM Human_Resources LIMIT 25;

 * mysql+mysqldb://root:***@localhost/HR_Analysis
25 rows affected.

[('00-0037846', 'Kimmy', 'Walczynski', datetime.date(1991, 6, 4), 'Male', 'Hispanic or Latino', 'Engineering', 'Programmer Analyst I', 'Headquarters', datetime.date(2002, 1, 20), None, 'Cleveland', 'Ohio\r', 32),
 ('00-0041533', 'Ignatius', 'Springett', datetime.date(1984, 6, 29), 'Male', 'White', 'Business Development', 'Business Analyst', 'Headquarters', datetime.date(2019, 4, 8), None, 'Cleveland', 'Ohio\r', 39),
 ('00-0045747', 'Corbie', 'Bittlestone', datetime.date(1989, 7, 29), 'Male', 'Black or African American', 'Sales', 'Solutions Engineer Manager', 'Headquarters', datetime.date(2010, 10, 12), None, 'Cleveland', 'Ohio\r', 33),
 ('00-0055274', 'Baxy', 'Matton', datetime.date(1982, 9, 14), 'Female', 'White', 'Services', 'Service Tech', 'Headquarters', datetime.date(2005, 4, 10), None, 'Cleveland', 'Ohio\r', 40),
 ('00-0076100', 'Terrell', 'Suff', datetime.date(1994, 4, 11), 'Female', 'Two or More Races', 'Product Management', 'Business Analyst', 'Remote', datetime.date(2010, 9, 29), datetime.date(2029, 10, 29), 'Flint', 'Michigan\r', 29),
 ('00-0116166', 'Kacie', 'Offiler', datetime.date(1971, 1, 18), 'Male', 'Asian', 'Engineering', 'Developer III', 'Headquarters', datetime.date(2018, 9, 1), None, 'Cleveland', 'Ohio\r', 52),
 ('00-0363185', 'Sandro', 'Admans', datetime.date(1979, 11, 19), 'Male', 'Two or More Races', 'Product Management', 'Quality Engineer', 'Headquarters', datetime.date(2012, 11, 8), None, 'Cleveland', 'Ohio\r', 43),
 ('00-0380704', 'Eugene', 'Lehrahan', datetime.date(1988, 10, 14), 'Female', 'Black or African American', 'Engineering', 'Developer I', 'Headquarters', datetime.date(2007, 6, 27), None, 'Cleveland', 'Ohio\r', 34),
 ('00-0381660', 'Wainwright', 'Corfield', datetime.date(1996, 12, 13), 'Male', 'Asian', 'Engineering', 'Business Systems Development Analyst', 'Headquarters', datetime.date(2001, 2, 20), datetime.date(2008, 12, 5), 'Cleveland', 'Ohio\r', 26),
 ('00-0419202', 'Dyann', 'Isoldi', datetime.date(1980, 3, 27), 'Male', 'Two or More Races', 'Engineering', 'Web Developer I', 'Headquarters', datetime.date(2005, 1, 27), None, 'Cleveland', 'Ohio\r', 43),
 ('00-0472287', 'Grantley', 'Oret', datetime.date(1975, 9, 6), 'Male', 'Two or More Races', 'Services', 'Service Tech II', 'Headquarters', datetime.date(2004, 11, 1), None, 'Cleveland', 'Ohio\r', 47),
 ('00-0472832', 'Elmore', 'Worner', datetime.date(1966, 1, 7), 'Female', 'White', 'Engineering', 'Business Systems Development Analyst', 'Headquarters', datetime.date(2000, 12, 5), None, 'Cleveland', 'Ohio\r', 57),
 ('00-0566380', 'Dud', 'Brain', datetime.date(1984, 3, 17), 'Male', 'Two or More Races', 'Business Development', 'Business Analyst', 'Headquarters', datetime.date(2008, 9, 17), None, 'Cleveland', 'Ohio\r', 39),
 ('00-0571075', 'Aguie', 'Conford', datetime.date(1971, 11, 2), 'Male', 'White', 'Business Development', 'Research Assistant II', 'Headquarters', datetime.date(2015, 11, 25), None, 'Cleveland', 'Ohio\r', 51),
 ('00-0624189', 'Katerina', 'Rosborough', datetime.date(1967, 8, 20), 'Male', 'Hispanic or Latino', 'Engineering', 'Analyst Programmer', 'Headquarters', datetime.date(2019, 5, 17), None, 'Cleveland', 'Ohio\r', 55),
 ('00-0715212', 'Alida', 'Longley', datetime.date(1973, 1, 28), 'Female', 'American Indian or Alaska Native', 'Accounting', 'Staff Accountant III', 'Headquarters', datetime.date(2002, 2, 4), None, 'Cleveland', 'Ohio\r', 50),
 ('00-0755645', 'Laraine', 'Petre', datetime.date(1967, 5, 11), 'Male', 'White', 'Engineering', 'Software Engineer I', 'Headquarters', datetime.date(2010, 9, 30), None, 'Cleveland', 'Ohio\r', 56),
 ('00-0778934', 'Gareth', 'MacCook', datetime.date(1987, 2, 21), 'Female', 'Black or African American', 'Legal', 'Senior Attorney', 'Remote', datetime.date(2010, 2, 18), None, 'Flint', 'Michigan\r', 36),
 ('00-0794247', 'Scottie', 'Chestney', datetime.date(1972, 2, 23), 'Female', 'Black or African American', 'Engineering', 'Data Visualization Specialist', 'Headquarters', datetime.date(2002, 7, 3), None, 'Cleveland', 'Ohio\r', 51),
 ('00-0948136', 'Christophorus', 'Boseley', datetime.date(1983, 5, 23), 'Female', 'Two or More Races', 'Marketing', 'Senior Editor', 'Headquarters', datetime.date(2007, 9, 6), None, 'Cleveland', 'Ohio\r', 40),
 ('00-0971612', 'Arleyne', 'Froome', datetime.date(1999, 8, 1), 'Male', 'Two or More Races', 'Engineering', 'Software Consultant', 'Headquarters', datetime.date(2015, 4, 9), None, 'Cleveland', 'Ohio\r', 23),
 ('00-1051096', 'Todd', 'Cashen', datetime.date(1999, 6, 19), 'Female', 'White', 'Accounting', 'Financial Analyst', 'Remote', datetime.date(2014, 6, 20), None, 'Pittsburgh', 'Pennsylvania\r', 24),
 ('00-1052230', 'Elmo', 'McNee', datetime.date(1988, 12, 16), 'Female', 'Black or African American', 'Services', 'Service Manager', 'Headquarters', datetime.date(2002, 7, 18), datetime.date(2006, 5, 22), 'Cleveland', 'Ohio\r', 34),
 ('00-1100714', 'Regen', 'Nafzger', datetime.date(1990, 4, 6), 'Male', 'White', 'Human Resources', 'Senior Recruiter', 'Headquarters', datetime.date(2016, 7, 23), datetime.date(2022, 7, 12), 'Cleveland', 'Ohio\r', 33),
 ('00-1147503', 'Penelope', 'Wenman', datetime.date(1994, 12, 19), 'Male', 'White', 'Business Development', 'Research Assistant II', 'Headquarters', datetime.date(2019, 9, 10), None, 'Cleveland', 'Ohio\r', 28)]

In [11]:
# after checking the dataset, we can see that the date format in birthdate,  hire_date are not consistent. Some dates with dash, some dates with hyphen. Some of date are missing the information for the completed year.
# Need to unify the date format to YYYY-MM-DD before doing any analysis
%sql DESCRIBE Human_Resources;

 * mysql+mysqldb://root:***@localhost/HR_Analysis
14 rows affected.

[('employee_id', 'varchar(255)', 'YES', '', None, ''),
 ('first_name', 'varchar(255)', 'YES', '', None, ''),
 ('last_name', 'varchar(255)', 'YES', '', None, ''),
 ('birthdate', 'date', 'YES', '', None, ''),
 ('gender', 'varchar(255)', 'YES', '', None, ''),
 ('race', 'varchar(255)', 'YES', '', None, ''),
 ('department', 'varchar(255)', 'YES', '', None, ''),
 ('jobtitle', 'varchar(255)', 'YES', '', None, ''),
 ('location', 'varchar(255)', 'YES', '', None, ''),
 ('hire_date', 'date', 'YES', '', None, ''),
 ('termdate', 'date', 'YES', '', None, ''),
 ('location_city', 'varchar(255)', 'YES', '', None, ''),
 ('location_state', 'varchar(255)', 'YES', '', None, ''),
 ('age', 'int', 'YES', '', None, '')]

In [12]:
%sql SELECT birthdate FROM Human_Resources LIMIT 25;

 * mysql+mysqldb://root:***@localhost/HR_Analysis
25 rows affected.

[(datetime.date(1991, 6, 4),),
 (datetime.date(1984, 6, 29),),
 (datetime.date(1989, 7, 29),),
 (datetime.date(1982, 9, 14),),
 (datetime.date(1994, 4, 11),),
 (datetime.date(1971, 1, 18),),
 (datetime.date(1979, 11, 19),),
 (datetime.date(1988, 10, 14),),
 (datetime.date(1996, 12, 13),),
 (datetime.date(1980, 3, 27),),
 (datetime.date(1975, 9, 6),),
 (datetime.date(1966, 1, 7),),
 (datetime.date(1984, 3, 17),),
 (datetime.date(1971, 11, 2),),
 (datetime.date(1967, 8, 20),),
 (datetime.date(1973, 1, 28),),
 (datetime.date(1967, 5, 11),),
 (datetime.date(1987, 2, 21),),
 (datetime.date(1972, 2, 23),),
 (datetime.date(1983, 5, 23),),
 (datetime.date(1999, 8, 1),),
 (datetime.date(1999, 6, 19),),
 (datetime.date(1988, 12, 16),),
 (datetime.date(1990, 4, 6),),
 (datetime.date(1994, 12, 19),)]

In [ ]:
# set SQL to allow the update of the table
#cursor.execute('SET SQL_SAFE_UPDATES = 0;')

In [26]:
%%sql
UPDATE Human_Resources  
SET birthdate = CASE 
WHEN birthdate LIKE '%-%' THEN DATE_FORMAT(STR_TO_DATE(birthdate, '%m-%d-%Y'), '%Y-%m-%d')
WHEN birthdate LIKE '%/%' THEN DATE_FORMAT(STR_TO_DATE(birthdate, '%m/%d/%Y'), '%Y-%m-%d')
ELSE NULL
END;

 * mysql+mysqldb://root:***@localhost/HR_Analysis
22214 rows affected.

[]

In [13]:
# check the update
%sql SELECT birthdate FROM Human_Resources LIMIT 25;

 * mysql+mysqldb://root:***@localhost/HR_Analysis
25 rows affected.

[(datetime.date(1991, 6, 4),),
 (datetime.date(1984, 6, 29),),
 (datetime.date(1989, 7, 29),),
 (datetime.date(1982, 9, 14),),
 (datetime.date(1994, 4, 11),),
 (datetime.date(1971, 1, 18),),
 (datetime.date(1979, 11, 19),),
 (datetime.date(1988, 10, 14),),
 (datetime.date(1996, 12, 13),),
 (datetime.date(1980, 3, 27),),
 (datetime.date(1975, 9, 6),),
 (datetime.date(1966, 1, 7),),
 (datetime.date(1984, 3, 17),),
 (datetime.date(1971, 11, 2),),
 (datetime.date(1967, 8, 20),),
 (datetime.date(1973, 1, 28),),
 (datetime.date(1967, 5, 11),),
 (datetime.date(1987, 2, 21),),
 (datetime.date(1972, 2, 23),),
 (datetime.date(1983, 5, 23),),
 (datetime.date(1999, 8, 1),),
 (datetime.date(1999, 6, 19),),
 (datetime.date(1988, 12, 16),),
 (datetime.date(1990, 4, 6),),
 (datetime.date(1994, 12, 19),)]

In [28]:
# There is another issue with the hire_date column. Some of the dates without the completed year information, years like '66' or '67' are incorrectly being interpreted as '2066' or '2067' instead of '1966' or '1967'.
# To fix this issue, we need to add a condition to the CASE statement to check if the year is greater than 2020, then subtract 100 years from the date.
# But before that, we need to convert the birthdate column to a date datatype first.
%sql ALTER TABLE Human_Resources MODIFY COLUMN birthdate DATE; # run in MySQL workbench to change the datatype, modify in python will cause error
%sql DESCRIBE Human_Resources

 * mysql+mysqldb://root:***@localhost/HR_Analysis
22214 rows affected.
 * mysql+mysqldb://root:***@localhost/HR_Analysis
13 rows affected.

[('employee_id', 'varchar(255)', 'YES', '', None, ''),
 ('first_name', 'varchar(255)', 'YES', '', None, ''),
 ('last_name', 'varchar(255)', 'YES', '', None, ''),
 ('birthdate', 'date', 'YES', '', None, ''),
 ('gender', 'varchar(255)', 'YES', '', None, ''),
 ('race', 'varchar(255)', 'YES', '', None, ''),
 ('department', 'varchar(255)', 'YES', '', None, ''),
 ('jobtitle', 'varchar(255)', 'YES', '', None, ''),
 ('location', 'varchar(255)', 'YES', '', None, ''),
 ('hire_date', 'varchar(255)', 'YES', '', None, ''),
 ('termdate', 'varchar(255)', 'YES', '', None, ''),
 ('location_city', 'varchar(255)', 'YES', '', None, ''),
 ('location_state', 'varchar(255)', 'YES', '', None, '')]

In [29]:
# Fix Y2K issue
%sql UPDATE Human_Resources   SET birthdate = CASE  WHEN YEAR(birthdate) > YEAR(CURDATE()) THEN DATE_SUB(birthdate, INTERVAL 100 YEAR) ELSE birthdate END;

 * mysql+mysqldb://root:***@localhost/HR_Analysis
22214 rows affected.

[]

In [30]:
%%sql
UPDATE Human_Resources  
SET hire_date = CASE 
WHEN hire_date LIKE '%-%' THEN DATE_FORMAT(STR_TO_DATE(hire_date, '%m-%d-%Y'), '%Y-%m-%d') # make sure there is no Python comment # or other characters before %%sql
WHEN hire_date LIKE '%/%' THEN DATE_FORMAT(STR_TO_DATE(hire_date, '%m/%d/%Y'), '%Y-%m-%d')
ELSE NULL
END;

 * mysql+mysqldb://root:***@localhost/HR_Analysis
22214 rows affected.

[]

In [14]:
%sql SELECT hire_date FROM Human_Resources LIMIT 25;

 * mysql+mysqldb://root:***@localhost/HR_Analysis
25 rows affected.

[(datetime.date(2002, 1, 20),),
 (datetime.date(2019, 4, 8),),
 (datetime.date(2010, 10, 12),),
 (datetime.date(2005, 4, 10),),
 (datetime.date(2010, 9, 29),),
 (datetime.date(2018, 9, 1),),
 (datetime.date(2012, 11, 8),),
 (datetime.date(2007, 6, 27),),
 (datetime.date(2001, 2, 20),),
 (datetime.date(2005, 1, 27),),
 (datetime.date(2004, 11, 1),),
 (datetime.date(2000, 12, 5),),
 (datetime.date(2008, 9, 17),),
 (datetime.date(2015, 11, 25),),
 (datetime.date(2019, 5, 17),),
 (datetime.date(2002, 2, 4),),
 (datetime.date(2010, 9, 30),),
 (datetime.date(2010, 2, 18),),
 (datetime.date(2002, 7, 3),),
 (datetime.date(2007, 9, 6),),
 (datetime.date(2015, 4, 9),),
 (datetime.date(2014, 6, 20),),
 (datetime.date(2002, 7, 18),),
 (datetime.date(2016, 7, 23),),
 (datetime.date(2019, 9, 10),)]

In [32]:
%sql ALTER TABLE Human_Resources MODIFY COLUMN hire_date DATE;

 * mysql+mysqldb://root:***@localhost/HR_Analysis
22214 rows affected.

[]

In [15]:
%sql DESCRIBE Human_Resources

 * mysql+mysqldb://root:***@localhost/HR_Analysis
14 rows affected.

[('employee_id', 'varchar(255)', 'YES', '', None, ''),
 ('first_name', 'varchar(255)', 'YES', '', None, ''),
 ('last_name', 'varchar(255)', 'YES', '', None, ''),
 ('birthdate', 'date', 'YES', '', None, ''),
 ('gender', 'varchar(255)', 'YES', '', None, ''),
 ('race', 'varchar(255)', 'YES', '', None, ''),
 ('department', 'varchar(255)', 'YES', '', None, ''),
 ('jobtitle', 'varchar(255)', 'YES', '', None, ''),
 ('location', 'varchar(255)', 'YES', '', None, ''),
 ('hire_date', 'date', 'YES', '', None, ''),
 ('termdate', 'date', 'YES', '', None, ''),
 ('location_city', 'varchar(255)', 'YES', '', None, ''),
 ('location_state', 'varchar(255)', 'YES', '', None, ''),
 ('age', 'int', 'YES', '', None, '')]

In [35]:
%sql SET SQL_SAFE_UPDATES = 0;

 * mysql+mysqldb://root:***@localhost/HR_Analysis
0 rows affected.

[]

In [37]:
%%sql
UPDATE Human_Resources
SET termdate = DATE(STR_TO_DATE(termdate, '%Y-%m-%d %H:%i:%s UTC')) #STR_TO_DATE(termdate, '%Y-%m-%d %H:%i:%s UTC') is used to convert the termdate string into a datetime value according to the format specified ('%Y-%m-%d %H:%i:%s UTC'). However, this datetime value includes both the date and the time.
# If you only want the date part and wish to ignore the time, you can use the DATE() function to extract just the date WHERE termdate IS NOT NULL AND termdate !='';
WHERE termdate IS NOT NULL AND termdate !=' ';

In [ ]:
%%sql
UPDATE Human_Resources
SET termdate = NULLIF(termdate, '');

In [38]:
%%sql
ALTER TABLE Human_Resources MODIFY COLUMN termdate DATE;

In [39]:
# create a age column to calculate the age of each employee
%sql ALTER TABLE Human_Resources ADD COLUMN age INT;

 * mysql+mysqldb://root:***@localhost/HR_Analysis
0 rows affected.

[]

In [40]:
# fill the age column with the age of each employee by using the DATEDIFF() function
%sql UPDATE Human_Resources SET age = TIMESTAMPDIFF(YEAR, birthdate, CURDATE());

 * mysql+mysqldb://root:***@localhost/HR_Analysis
22214 rows affected.

[]

### Questions

#### What is the gender distribution of the employees in the company?

In [22]:
%%sql
SELECT gender, count(*) AS Count
FROM Human_Resources
WHERE termdate IS NULL
GROUP BY gender;

 * mysql+mysqldb://root:***@localhost/HR_Analysis
3 rows affected.

[('Male', 9328), ('Female', 8455), ('Non-Conforming', 502)]

#### What is the race breakdown of the employees in the company?

In [23]:
%%sql
SELECT race, count(*) AS Count
FROM Human_Resources
WHERE termdate IS NULL
GROUP BY race
ORDER BY Count DESC;

 * mysql+mysqldb://root:***@localhost/HR_Analysis
7 rows affected.

[('White', 5214),
 ('Two or More Races', 2989),
 ('Black or African American', 2983),
 ('Asian', 2936),
 ('Hispanic or Latino', 2074),
 ('American Indian or Alaska Native', 1098),
 ('Native Hawaiian or Other Pacific Islander', 991)]

#### What is the age distribution of employees in the company?

In [24]:
%%sql
SELECT CASE
                WHEN age >= 18 AND age <= 25 THEN '18-25'
                WHEN age >= 26 AND age <= 35 THEN '26-35'
                WHEN age >= 36 AND age <= 45 THEN '36-45'
                WHEN age >= 46 AND age <= 55 THEN '46-55'
                WHEN age >= 56 AND age <= 65 THEN '56-65'
                Else '65+' END AS age_group, gender, COUNT(*) AS Count
FROM Human_Resources
WHERE termdate is NULL
GROUP BY age_group, gender
ORDER BY age_group,gender

 * mysql+mysqldb://root:***@localhost/HR_Analysis
15 rows affected.

[('18-25', 'Female', 1192),
 ('18-25', 'Male', 1307),
 ('18-25', 'Non-Conforming', 66),
 ('26-35', 'Female', 2368),
 ('26-35', 'Male', 2518),
 ('26-35', 'Non-Conforming', 142),
 ('36-45', 'Female', 2177),
 ('36-45', 'Male', 2592),
 ('36-45', 'Non-Conforming', 134),
 ('46-55', 'Female', 2352),
 ('46-55', 'Male', 2487),
 ('46-55', 'Non-Conforming', 138),
 ('56-65', 'Female', 366),
 ('56-65', 'Male', 424),
 ('56-65', 'Non-Conforming', 22)]

#### How many employees work at headquarters versus remote locations?

In [25]:
%%sql
SELECT location, COUNT(*) AS Count
FROM Human_Resources
WHERE termdate IS NULL
GROUP BY location
ORDER BY Count DESC;

 * mysql+mysqldb://root:***@localhost/HR_Analysis
2 rows affected.

[('Headquarters', 13710), ('Remote', 4575)]

#### What is the average length of employment for employees who have been terminated?

In [26]:
%%sql
SELECT ROUND(AVG(DATEDIFF(termdate, hire_date))/365,0) AS avg_length_of_employment
FROM Human_Resources
WHERE termdate IS NOT NULL  AND termdate <= CURDATE();

 * mysql+mysqldb://root:***@localhost/HR_Analysis
1 rows affected.

[(Decimal('8'),)]

#### How does the gender distribution vary across departments and job titles?

In [27]:
%%sql
SELECT department, gender, COUNT(*) AS Count
FROM Human_Resources
WHERE termdate IS NULL
GROUP BY department, gender
ORDER BY department;

 * mysql+mysqldb://root:***@localhost/HR_Analysis
38 rows affected.

[('Accounting', 'Female', 1234),
 ('Accounting', 'Male', 1437),
 ('Accounting', 'Non-Conforming', 76),
 ('Auditing', 'Female', 20),
 ('Auditing', 'Male', 20),
 ('Business Development', 'Female', 620),
 ('Business Development', 'Male', 705),
 ('Business Development', 'Non-Conforming', 42),
 ('Engineering', 'Female', 2553),
 ('Engineering', 'Male', 2790),
 ('Engineering', 'Non-Conforming', 158),
 ('Human Resources', 'Female', 707),
 ('Human Resources', 'Male', 753),
 ('Human Resources', 'Non-Conforming', 38),
 ('Legal', 'Female', 113),
 ('Legal', 'Male', 128),
 ('Legal', 'Non-Conforming', 7),
 ('Marketing', 'Female', 208),
 ('Marketing', 'Male', 209),
 ('Marketing', 'Non-Conforming', 5),
 ('Product Management', 'Female', 233),
 ('Product Management', 'Male', 281),
 ('Product Management', 'Non-Conforming', 13),
 ('Research and Development', 'Female', 422),
 ('Research and Development', 'Male', 422),
 ('Research and Development', 'Non-Conforming', 28),
 ('Sales', 'Female', 684),
 ('Sales', 'Male', 773),
 ('Sales', 'Non-Conforming', 40),
 ('Services', 'Female', 669),
 ('Services', 'Male', 695),
 ('Services', 'Non-Conforming', 29),
 ('Support', 'Female', 351),
 ('Support', 'Male', 393),
 ('Support', 'Non-Conforming', 28),
 ('Training', 'Female', 641),
 ('Training', 'Male', 722),
 ('Training', 'Non-Conforming', 38)]

#### What is the distribution of job titles across the company?

In [28]:
%%sql
SELECT jobtitle, count(*) as Count
FROM Human_Resources
WHERE termdate IS NULL
GROUP BY jobtitle
ORDER BY Count DESC

 * mysql+mysqldb://root:***@localhost/HR_Analysis
182 rows affected.

[('Research Assistant II', 634),
 ('Business Analyst', 574),
 ('Human Resources Analyst II', 495),
 ('Research Assistant I', 434),
 ('Account Executive', 409),
 ('Staff Accountant I', 375),
 ('Data Visualization Specialist', 366),
 ('Human Resources Analyst', 338),
 ('Software Engineer I', 323),
 ('Systems Administrator I', 316),
 ('Analyst Programmer', 309),
 ('Data Coordiator', 290),
 ('Senior Developer', 290),
 ('Business Systems Development Analyst', 284),
 ('Service Tech III', 283),
 ('Project Manager', 278),
 ('Service Tech II', 276),
 ('Help Desk Technician', 276),
 ('Service Manager', 273),
 ('Software Consultant', 271),
 ('Service Coordinator', 271),
 ('Service Tech', 264),
 ('Senior Cost Accountant', 263),
 ('Structural Engineer', 261),
 ('Desktop Support Technician', 257),
 ('Cost Accountant', 255),
 ('Tax Accountant', 238),
 ('Recruiter', 195),
 ('Account Manager', 193),
 ('Operator', 185),
 ('Solutions Engineer', 179),
 ('Senior Recruiter', 175),
 ('Relationshiop Manager', 174),
 ('Pre-Sales Consultant', 173),
 ('Solutions Engineer Manager', 172),
 ('Research Associate', 171),
 ('HR Manager', 169),
 ('Trainer I', 162),
 ('Customer Success Manager', 161),
 ('Administrative Assistant I', 158),
 ('Trainer II', 156),
 ('Training Manager', 154),
 ('Senior Trainer', 153),
 ('Assistant Trainer', 148),
 ('Trainer III', 146),
 ('Budget/Accounting Analyst IV', 141),
 ('Budget/Accounting Analyst II', 139),
 ('Junior Trainer', 138),
 ('Budget/Accounting Analyst III', 132),
 ('Budget/Accounting Analyst I', 128),
 ('Senior Editor', 123),
 ('Senior Quality Engineer', 118),
 ('Media Manager I', 111),
 ('Quality Control Specialist', 109),
 ('Support Staff', 84),
 ('Staff Accountant IV', 84),
 ('Software Engineer III', 83),
 ('Programmer Analyst I', 82),
 ('Web Developer I', 82),
 ('Staff Accountant III', 82),
 ('Programmer Analyst II', 80),
 ('Software Test Engineer IV', 77),
 ('Chief Design Engineer', 77),
 ('Accounting Assistant I', 76),
 ('Software Engineer IV', 76),
 ('Computer Systems Analyst II', 75),
 ('Software Engineer II', 74),
 ('Accountant III', 74),
 ('Systems Administrator III', 74),
 ('Database Administrator IV', 74),
 ('Accounting Assistant II', 74),
 ('Developer I', 73),
 ('Editor', 73),
 ('Computer Systems Analyst I', 73),
 ('Help Desk Operator', 73),
 ('Database Administrator II', 72),
 ('Programmer I', 72),
 ('Accounting Assistant IV', 72),
 ('Accountant II', 71),
 ('Software Test Engineer I', 71),
 ('Accountant IV', 71),
 ('Programmer II', 70),
 ('Database Administrator III', 69),
 ('Programmer III', 68),
 ('Software Test Engineer III', 68),
 ('Staff Accountant II', 68),
 ('Web Developer II', 68),
 ('Programmer Analyst III', 68),
 ('Programmer Analyst IV', 68),
 ('Database Administrator I', 66),
 ('Systems Administrator IV', 66),
 ('Accountant I', 65),
 ('VP Accounting', 65),
 ('Accounting Assistant III', 64),
 ('Developer III', 63),
 ('Systems Administrator II', 62),
 ('Developer IV', 62),
 ('Computer Systems Analyst III', 61),
 ('Human Resources Manager', 58),
 ('Web Developer IV', 58),
 ('Software Test Engineer II', 58),
 ('Computer Systems Analyst IV', 56),
 ('Web Developer III', 55),
 ('Developer II', 54),
 ('Quality Engineer', 53),
 ('Financial Analyst', 51),
 ('Programmer IV', 51),
 ('Paralegal', 49),
 ('Senior Financial Analyst', 49),
 ('Product Engineer', 47),
 ('Support Staff II', 46),
 ('Content Developer II', 46),
 ('Administrative Officer', 46),
 ('Content Developer III', 45),
 ('Design Engineer', 44),
 ('Media Manager II', 43),
 ('Content Developer', 43),
 ('Assistant Manager', 41),
 ('Internal Auditor', 40),
 ('Administrative Assistant II', 38),
 ('VP Marketing', 38),
 ('Analog Circuit Design manager', 38),
 ('Structural Analysis Engineer', 38),
 ('Senior Attorney', 35),
 ('Attorney', 35),
 ('VP Quality Control', 34),
 ('VP Product Management', 33),
 ('Information Systems Manager', 32),
 ('Executive Assistant', 32),
 ('Research Assistant', 31),
 ('Administrative Assistant', 29),
 ('Automation Specialist II', 28),
 ('Staff Scientist', 28),
 ('Financial Advisor', 27),
 ('Web Designer I', 27),
 ('Compensation Analyst', 26),
 ('Electrical Engineer', 24),
 ('Automation Specialist I', 23),
 ('Community Outreach Specialist', 23),
 ('Actuary', 22),
 ('General Manager', 21),
 ('Mechanical Systems Engineer', 21),
 ('Librarian', 20),
 ('Recruiting Manager', 19),
 ('Support Staff III', 17),
 ('Automation Specialist IV', 17),
 ('Legal Assistant', 17),
 ('Payment Adjustment Coordinator', 16),
 ('Research Assistant III', 15),
 ('Human Resources Assistant III', 14),
 ('Administrative Assistant III', 14),
 ('Senior Sales Associate', 12),
 ('Automation Specialist III', 11),
 ('Human Resources Assistant IV', 10),
 ('Statistician II', 10),
 ('Human Resources Assistant II', 10),
 ('Human Resources Assistant I', 10),
 ('Web Designer III', 10),
 ('Statistician I', 10),
 ('Graphic Designer', 9),
 ('Marketing Assistant', 8),
 ('Director of Sales', 8),
 ('Research Assistant IV', 7),
 ('Web Designer IV', 7),
 ('Engineer I', 7),
 ('VP Sales', 6),
 ('Office Assistant I', 6),
 ('Administrative Assistant IV', 6),
 ('Business Development Manager', 5),
 ('Engineer III', 5),
 ('Sales Associate', 5),
 ('Engineer II', 4),
 ('Engineer IV', 3),
 ('Sales Representative', 3),
 ('Web Designer II', 3),
 ('Account Coordinator', 2),
 ('Statistician III', 2),
 ('Marketing Manager', 1),
 ('Associate Professor', 1),
 ('VP of Training and Development', 1),
 ('Office Assistant IV', 1),
 ('Assistant Professor', 1)]

#### Which department has the highest turnover rate?

In [29]:
%%sql
SELECT department,
    total_count,
    terminated_count,
    terminated_count/total_count AS termination_rate
FROM(
    SELECT department,
    COUNT(*) AS total_count,
    SUM(CASE WHEN termdate IS NOT NULL AND termdate <= CURDATE() THEN 1 ELSE 0 END) AS terminated_count
    FROM Human_Resources
    GROUP BY department) AS subquery
ORDER BY termination_rate DESC

 * mysql+mysqldb://root:***@localhost/HR_Analysis
13 rows affected.

[('Auditing', 52, Decimal('8'), Decimal('0.1538')),
 ('Legal', 311, Decimal('38'), Decimal('0.1222')),
 ('Training', 1692, Decimal('192'), Decimal('0.1135')),
 ('Research and Development', 1084, Decimal('120'), Decimal('0.1107')),
 ('Human Resources', 1807, Decimal('198'), Decimal('0.1096')),
 ('Engineering', 6686, Decimal('719'), Decimal('0.1075')),
 ('Accounting', 3333, Decimal('356'), Decimal('0.1068')),
 ('Sales', 1832, Decimal('195'), Decimal('0.1064')),
 ('Product Management', 641, Decimal('68'), Decimal('0.1061')),
 ('Services', 1686, Decimal('178'), Decimal('0.1056')),
 ('Support', 954, Decimal('98'), Decimal('0.1027')),
 ('Business Development', 1642, Decimal('152'), Decimal('0.0926')),
 ('Marketing', 494, Decimal('44'), Decimal('0.0891'))]

#### What is the distribution of employees across locations by state?

In [31]:
%%sql
SELECT location_state, COUNT(*) AS Count
FROM Human_Resources
WHERE termdate IS NULL
GROUP BY location_state
ORDER BY Count DESC

 * mysql+mysqldb://root:***@localhost/HR_Analysis
7 rows affected.

[('Ohio\r', 14788),
 ('Pennsylvania\r', 930),
 ('Illinois\r', 730),
 ('Indiana\r', 572),
 ('Michigan\r', 569),
 ('Kentucky\r', 375),
 ('Wisconsin\r', 321)]

#### How has the company's employee count changed over time based on hire and term dates?

In [35]:
%%sql
SELECT Year,
    Hires,
    Terminations,
    (Hires-Terminations) AS Net_change,
    ROUND(((Hires - Terminations) / hires * 100), 2) AS Net_change_percent
FROM(
    SELECT YEAR(hire_date) AS Year,
    COUNT(*) AS Hires,
    SUM(CASE WHEN termdate IS NOT NULL and termdate <= CURDATE() THEN 1 ELSE 0 END) AS Terminations
FROM Human_Resources
GROUP BY YEAR(hire_date)) AS subquery
ORDER BY Year ASC

 * mysql+mysqldb://root:***@localhost/HR_Analysis
21 rows affected.

[(2000, 220, Decimal('31'), Decimal('189'), Decimal('85.91')),
 (2001, 1122, Decimal('203'), Decimal('919'), Decimal('81.91')),
 (2002, 1067, Decimal('173'), Decimal('894'), Decimal('83.79')),
 (2003, 1142, Decimal('192'), Decimal('950'), Decimal('83.19')),
 (2004, 1135, Decimal('195'), Decimal('940'), Decimal('82.82')),
 (2005, 1097, Decimal('173'), Decimal('924'), Decimal('84.23')),
 (2006, 1118, Decimal('175'), Decimal('943'), Decimal('84.35')),
 (2007, 1090, Decimal('140'), Decimal('950'), Decimal('87.16')),
 (2008, 1108, Decimal('139'), Decimal('969'), Decimal('87.45')),
 (2009, 1140, Decimal('144'), Decimal('996'), Decimal('87.37')),
 (2010, 1099, Decimal('123'), Decimal('976'), Decimal('88.81')),
 (2011, 1101, Decimal('111'), Decimal('990'), Decimal('89.92')),
 (2012, 1103, Decimal('105'), Decimal('998'), Decimal('90.48')),
 (2013, 1105, Decimal('92'), Decimal('1013'), Decimal('91.67')),
 (2014, 1053, Decimal('84'), Decimal('969'), Decimal('92.02')),
 (2015, 1059, Decimal('70'), Decimal('989'), Decimal('93.39')),
 (2016, 1122, Decimal('62'), Decimal('1060'), Decimal('94.47')),
 (2017, 1091, Decimal('49'), Decimal('1042'), Decimal('95.51')),
 (2018, 1147, Decimal('43'), Decimal('1104'), Decimal('96.25')),
 (2019, 1083, Decimal('42'), Decimal('1041'), Decimal('96.12')),
 (2020, 1012, Decimal('20'), Decimal('992'), Decimal('98.02'))]

#### What is the tenure distribution for each department?

In [37]:
%%sql
SELECT department, ROUND(AVG(DATEDIFF(CURDATE(), termdate)/365),0) as avg_tenure
FROM Human_Resources
WHERE termdate <= CURDATE() AND termdate IS NOT NULL
GROUP BY department

 * mysql+mysqldb://root:***@localhost/HR_Analysis
13 rows affected.

[('Engineering', Decimal('8')),
 ('Services', Decimal('7')),
 ('Human Resources', Decimal('8')),
 ('Business Development', Decimal('9')),
 ('Sales', Decimal('7')),
 ('Auditing', Decimal('9')),
 ('Marketing', Decimal('7')),
 ('Training', Decimal('8')),
 ('Accounting', Decimal('8')),
 ('Research and Development', Decimal('7')),
 ('Support', Decimal('8')),
 ('Product Management', Decimal('8')),
 ('Legal', Decimal('9'))]